#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results value :colnames yes :session *R:scoped-verbs-variants*

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(dplyr)
#+end_src
\\

- バージョン
#+begin_src R :results output :exports both
packageVersion("dplyr")
#+end_src

#+RESULTS:
: [1] ‘0.8.3’
\\

** ★☆☆ ~num_range(prefix, range, width = NULL, vars = peek_vars())~.

- prefix + 連番のような列名から連番の範囲を指定して抽出できる

#+begin_src R :exports both :results output
col_names <- c("col01", "col02", "col03", "col04")
tidyselect::vars_select(col_names, num_range(prefix = "col", range = 1:3, width = 2))
#+end_src

#+RESULTS:
:   col01   col02   col03 
: "col01" "col02" "col03"
\\

** ★★☆ ~one_of(..., .vars = peek_vars())~.

- character vector で列を指定

#+begin_src R :exports both :results output
col_names <- names(iris)
tidyselect::vars_select(col_names, one_of(c("Sepal.Width", "Petal.Width")))
#+end_src

#+RESULTS:
:   Sepal.Width   Petal.Width 
: "Sepal.Width" "Petal.Width"
\\

** ★☆☆ ~everything(vars = peek_vars())~.

- 全てにマッチする
 
#+begin_src R :exports both :results output
col_names <- names(iris)
tidyselect::vars_select(col_names, everything())
#+end_src

#+RESULTS:
:   Sepal.Length    Sepal.Width   Petal.Length    Petal.Width        Species 
: "Sepal.Length"  "Sepal.Width" "Petal.Length"  "Petal.Width"      "Species"
\\

- 特定の列を先頭に持ってきたい場合に、「残り全て」を指定するために使う

#+begin_src R
FANG %>% select(date, everything()) %>% head(4)
#+end_src

#+RESULTS:
|       date | symbol |  open |  high |   low | close |   volume | adjusted |
|------------+--------+-------+-------+-------+-------+----------+----------|
| 2013-01-02 | FB     | 27.44 | 28.18 | 27.42 |    28 | 69846400 |       28 |
| 2013-01-03 | FB     | 27.88 | 28.47 | 27.59 | 27.77 | 63140600 |    27.77 |
| 2013-01-04 | FB     | 28.01 | 28.93 | 27.83 | 28.76 | 72715400 |    28.76 |
| 2013-01-07 | FB     | 28.69 | 29.79 | 28.65 | 29.42 | 83781800 |    29.42 |
\\

* 実行環境

#+begin_src R :results output :exports both
sessionInfo()
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.1 (2019-07-05)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.3 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.7.1
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.7.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
[1] rlang_0.4.0                tidyquant_0.5.7           
[3] quantmod_0.4-15            TTR_0.23-5                
[5] PerformanceAnalytics_1.5.3 xts_0.11-2                
[7] zoo_1.8-6                  lubridate_1.7.4           
[9] dplyr_0.8.3               

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.2       rstudioapi_0.10  magrittr_1.5     tidyselect_0.2.5
 [5] lattice_0.20-38  R6_2.4.0         quadprog_1.5-7   fansi_0.4.0     
 [9] httr_1.4.1       stringr_1.4.0    tools_3.6.1      grid_3.6.1      
[13] utf8_1.1.4       cli_1.1.0        assertthat_0.2.1 tibble_2.1.3    
[17] crayon_1.3.4     purrr_0.3.2      vctrs_0.2.0      zeallot_0.1.0   
[21] curl_3.3         Quandl_2.10.0    glue_1.3.1       stringi_1.4.3   
[25] compiler_3.6.1   pillar_1.4.2     backports_1.1.5  jsonlite_1.6    
[29] pkgconfig_2.0.3
#+end_example
